{ "type": "LOCATION", "id": "loc_safetyZone",
  "name": "Green Zone Safety Camp",
  "locationType": "compound",
  "description": "A fortified former high school and surrounding neighborhood that serves as one of the last secure human settlements in the region. Fifteen-foot walls made of concrete barriers, shipping containers, and scavenged materials surround the perimeter, with guard towers at strategic points. Inside, nearly 200 survivors have created a fragile community.",
  "discoveredByPlayer": true,

  "connectedLocations": [
    { "type": "LOCATION", "id": "loc_abandonedMall",
      "description": "A partially collapsed shopping mall two miles east that may still contain supplies but is known to be infested with infected."
    },
    { "type": "LOCATION", "id": "loc_hospitalRuins",
      "description": "The ruins of County General Hospital, a dangerous but potentially resource-rich location."
    }
  ],

  "parentLocation": { "type": "LOCATION", "id": "loc_midwestRegion",
    "description": "The Eastbrook Safety Zone is located in what was once a suburban area outside a mid-sized Midwestern city."
  },

  "subLocations": [
    { "type": "LOCATION", "id": "loc_safetyZone_commandCenter",
      "description": "The former principal's office and administrative area, now serving as the command and operations center for the safety zone."
    },
    { "type": "LOCATION", "id": "loc_safetyZone_medicalWing",
      "description": "The converted gymnasium now serves as a medical facility, currently under strain from a shortage of antibiotics."
    }
  ],

  "npcs": [
    "npc_captainRivera"
  ],

  "pointsOfInterest": [
    {
      "name": "Eastern Wall Breach",
      "description": "A section of the eastern perimeter wall that shows recent damage from what appears to be a coordinated attack by infected."
    },
    {
      "name": "Community Garden",
      "description": "A carefully tended vegetable garden in the former athletic field, providing crucial fresh food for the settlement."
    },
    {
      "name": "Armory",
      "description": "A heavily guarded room containing the settlement's limited supply of weapons and ammunition."
    }
  ],

  "questIds": ["quest_medicalSupplies"],

  "items": [],

  "historyLog": [
    {
      "timestamp": "2023-05-15T12:15:00Z",
      "event": "playerArrived",
      "description": "The player was admitted to the safety zone after being found scavenging nearby."
    },
    {
      "timestamp": "2023-05-15T16:45:00Z",
      "event": "alarmRaised",
      "npcId": "npc_captainRivera",
      "description": "Captain Rivera ordered increased patrols along the eastern wall after sensors detected unusual activity."
    }
  ],

  "notes": "Morale at the safety zone is deteriorating due to dwindling supplies and increasing infected attacks. Three residents disappeared last week, leading to suspicions of either infected infiltration or desperate desertion."
} 

