{
  "genre": "fantasy",
  "theme": "isekai",
  "description": "A modern-day person suddenly finds themselves transported to the Forgotten Realms, specifically the Sword Coast region of Faerûn. With no explanation for their arrival and nothing but the clothes on their back, they must navigate this new world of magic, monsters, and ancient secrets. The Sword Coast is a dangerous yet wondrous place, home to legendary cities like Waterdeep, Baldur's Gate, and Neverwinter, as well as countless ruins, dungeons, and natural wonders. This is a world where gods walk among mortals, where archmages wield reality-bending powers, and where heroes can rise from the most unlikely origins. As an outsider with knowledge of Earth, the player brings unique perspectives to Faerûn, perhaps seeing connections and patterns that natives might miss. Will they seek a way home, or embrace their new life in this realm of high adventure?\n\nTIMELINE: Post-Spellplague, circa 1480s DR\n\nPLAYER BACKGROUND: The player character is a modern-day Earth human with no special powers, training, or magical abilities. They were living a normal life on Earth until suddenly awakening in Faerûn with no explanation. They retain all memories of their former life and knowledge of Earth culture, technology, and history, but have no immediate means to return.\n\nKEY LOCATIONS OF INTEREST:\n- Neverwinter: The Jewel of the North, recently rebuilt after volcanic destruction, filled with intrigue and opportunity.\n- Waterdeep: The City of Splendors, a massive metropolis representing the height of civilization in the Realms.\n- Baldur's Gate: A city of commerce and corruption on the Sword Coast, named for legendary hero Balduran.\n- Luskan: The City of Sails, a rough northern port city with a reputation for piracy and danger.\n- The High Forest: Ancient woodland filled with elven ruins, treants, and mysteries older than human civilization.\n- The Underdark: A vast network of underground caverns and passages home to drow, mind flayers, and other horrors.\n\nMAJOR FACTIONS:\n- The Lords' Alliance: A coalition of cities and settlements across the Sword Coast, working toward mutual security and prosperity.\n- The Harpers: A secretive organization of spellcasters and spies who work to thwart evil and preserve knowledge.\n- The Zhentarim: Also known as the Black Network, a mercantile organization with legal and illegal operations throughout Faerûn.\n- The Emerald Enclave: Druids and rangers dedicated to maintaining the balance of nature in the face of civilization's expansion.\n\nIMPORTANT HISTORICAL EVENTS:\n- The Spellplague: A magical catastrophe that transformed parts of Faerûn and altered how magic functions.\n- The Sundering: A recent world-shaking event where the gods walked Toril in avatar form and reality was reshaped.\n\nMAGICAL REALITY: The world is saturated with magic unlike Earth. Arcane spellcasters, divine priests, mystical artifacts, and supernatural creatures are all part of everyday reality. The player will need to adapt to a world where physics doesn't always work the same way as Earth, and where forces beyond mortal understanding regularly influence events. The world of Faerun is very varied in species, so a lot of the people the player meets are not humans.",
  "startingLocation": "loc_sword_mountains_foothills",
  "gameName": "Stranger in a Familiar Land: An Isekai Adventure",
  "setting": "Forgotten Realms",
  "currencies": ["Copper", "Silver", "Electrum", "Gold", "Platinum"],
  "economy": "Currency conversion: 1 Platinum = 10 Gold = 20 Electrum = 100 Silver = 1000 Copper\n\nTypical costs:\n- Simple meal at tavern: 3 Silver to 5 Silver\n- Ale, mug: 4 Copper\n- Fine wine, bottle: 10 Gold\n- Bread loaf: 2 Copper\n- Inn stay (poor): 5 Silver per night\n- Inn stay (modest): 1 Gold per night\n- Inn stay (wealthy): 2 Gold or more per night\n- Basic dagger: 2 Gold\n- Longsword: 15 Gold\n- Simple clothes: 5 Silver\n- Traveler's clothes: 2 Gold\n- Fine clothes: 15 Gold\n\nTypical incomes:\n- Village (poor): 5-10 Gold monthly (farmer, laborer)\n- Village (modest): 10-30 Gold monthly (skilled craftsperson, village healer)\n- Village (wealthy): 30-50 Gold monthly (merchant, landowner)\n- Town (poor): 10-20 Gold monthly (common laborer, street vendor)\n- Town (modest): 30-60 Gold monthly (skilled tradesperson, guard)\n- Town (wealthy): 60-200 Gold monthly (successful merchant, local official)\n- City (poor): 15-30 Gold monthly (unskilled worker, street performer)\n- City (modest): 50-100 Gold monthly (skilled artisan, lower guard officer)\n- City (wealthy): 200-1000+ Gold monthly (noble, guild master, high official)"
} 