{
  "id": "lore_firstContact",
  "title": "The First Contact War",
  "summary": "Humanity's disastrous first encounter with the alien Xenovek species, leading to decades of tension and cold war.",
  "fullDescription": "In 2453, the exploration vessel ISV Pathfinder encountered a non-human ship in the HD 219134 system. Initial attempts at communication failed, and when the Pathfinder's captain activated scanning equipment, the alien vessel responded with immediate hostility. The resulting firefight destroyed the Pathfinder with only a handful of survivors escaping in pods. This marked humanity's first contact with the Xenovek, a highly advanced species with territorial claims in the same region humans were expanding into. Over the next six months, a series of brutal skirmishes escalated into the First Contact War, claiming over 15,000 human lives and an unknown number of Xenovek. The war ended with the Treaty of Proxima in 2454, establishing neutral zones and communication protocols, but hostilities have continued through espionage, proxy conflicts, and technological competition.",
  "relevance": {
    "currentImportance": "high", 
    "associatedQuests": ["quest_missingData"],
    "associatedNpcs": ["npc_commanderVoss"],
    "associatedLocations": ["loc_axiomStation", "loc_orionSector"]
  },
  "rumors": [
    "Some military intelligence suggests the Xenovek attacked because they detected the Pathfinder scanning specific biological signatures they consider sacred.",
    "Underground information networks claim the current Xenovek leadership is divided between war hawks and a moderate faction seeking genuine cooperation with humans."
  ],
  "historicalEvents": [
    {
      "timestamp": "2453-09-14",
      "event": "firstContact",
      "description": "ISV Pathfinder encounters Xenovek vessel in HD 219134 system. Communication attempts fail, and hostilities begin."
    },
    {
      "timestamp": "2453-11-30",
      "event": "axanarMassacre",
      "description": "Xenovek forces attack the research outpost on Axanar IV, killing all 342 civilian scientists and their families."
    },
    {
      "timestamp": "2454-04-22",
      "event": "treatyOfProxima",
      "description": "After devastating losses on both sides, the Treaty of Proxima establishes uneasy peace between humans and Xenovek."
    },
    {
      "timestamp": "2485-07-08",
      "event": "axiomEstablishment",
      "description": "Axiom Research Station is established in a legally gray border region to study Xenovek biology and technology while maintaining plausible deniability."
    }
  ],
  "notes": "Commander Voss served in a specialized intelligence unit during the latter stages of the First Contact War, giving her unique insight into Xenovek psychology and tactics. Axiom Station's research is officially 'defensive,' but some suspect it has applications that would violate the Treaty of Proxima."
} 