{ 
  "type": "NPC", 
  "id": "npc_sheriffCarter",
  "name": "Sheriff Evelyn Carter",
  "age": 54,
  "currentLocationId": "loc_sheriffStation",
  "knownToPlayer": false,
  "knowsPlayer": false,
  "visibleToPlayer": true,
  "visualDescription": {
    "gender": "female",
    "body": "tall and lean",
    "visibleClothing": "Neatly pressed sheriff's uniform with a weathered leather jacket",
    "condition": "Mid-50s, with sharp eyes and premature gray hair"
  },
  "personality": {
    "temperament": "Reserved and analytical",
    "quirks": "Observant, protective of the town, tightly controlled emotions, skeptical of outsiders",
    "motivations": "Maintaining order, protecting town secrets, finding personal redemption",
    "fears": "Failing the town, history repeating itself",
    "secrets": [
      "She knows more about the Thomas family disappearance than she has revealed",
      "She keeps a private journal about the case"
    ]
  },
  "backstory": "Born and raised in Blackwater Bay, Evelyn left to join the FBI for fifteen years before returning after the Thomas family disappearance to become sheriff. She was childhood friends with Elizabeth Thomas and took her disappearance personally. Has maintained law and order with an iron grip for two decades.",
  "currentGoal": "Keep the town's secrets hidden from outsiders",
  "dispositionTowardsPlayer": "never met",
  "knownEntities": {
    "npcsKnown": [],
    "locationsKnown": ["loc_harbourPointHotel", "loc_mainStreet", "loc_sheriffStation", "loc_sirensCove", "loc_blackwaterBay"]
  },
  "questInvolvement": ["quest_missingJournalist"],
  "inventory": [
    {
      "name": "Sheriff Badge",
      "description": "A polished metal badge denoting authority in Blackwater Bay",
      "quantity": 1
    },
    {
      "name": "Service Revolver",
      "description": "Standard issue firearm, worn but well-maintained",
      "quantity": 1
    },
    {
      "name": "Old Case Files",
      "description": "Yellowed folder containing notes on past town incidents",
      "quantity": 1
    }
  ],
  "conversationLog": [
    {
      "Player": "I'm curious about the journalist who went missing.",
      "Sheriff Carter": "Ms. Chen? Yes, we're looking into her disappearance. Not our first visitor to wander off in unfamiliar territory. Tourists often underestimate the dangers of our coastal paths. Why exactly are you interested in her case?"
    },
    {
      "Player": "Just concerned. Has anyone else gone missing recently?",
      "Sheriff Carter": "We're a small town with limited resources, not a resort with lifeguards at every corner. People need to exercise caution. But to answer your question directly: no. Ms. Chen's case is isolated. I suggest you enjoy your stay and leave the investigating to professionals. Tourist accidents bring unwanted attention that hurts our community."
    }
  ]
} 
