{ 
  "type": "NPC", 
  "id": "npc_deputyParker",
  "name": "Deputy Marcus Parker",
  "age": 32,
  "currentLocationId": "loc_sheriffStation",
  "knownToPlayer": false,
  "knowsPlayer": false,
  "visibleToPlayer": true,
  "visualDescription": {
    "gender": "male",
    "body": "athletic, broad-shouldered",
    "visibleClothing": "Crisp deputy uniform, always perfectly maintained",
    "condition": "Early 30s, with a military-style haircut and alert posture"
  },
  "personality": {
    "temperament": "By-the-book and efficient",
    "quirks": "Loyal, ambitious, detail-oriented, uncomfortable with deception",
    "motivations": "Serving justice, discovering the truth, protecting the town",
    "fears": "Betraying his principles, failing those who depend on him",
    "secrets": [
      "He's conducting his own unofficial investigation into Maya Chen's disappearance",
      "He suspects Sheriff Carter is hiding information about past disappearances"
    ]
  },
  "backstory": "Marcus Parker grew up in Blackwater Bay, left for military service, and returned four years ago to join the sheriff's department. He respects Sheriff Carter immensely but is beginning to question some of the department's handling of certain cases. His father was a deputy during the Thomas family disappearance, and Marcus has grown up hearing conflicting stories about that night. He's engaged to the town librarian, who has been helping Maya Chen research local history.",
  "currentGoal": "Discover what really happened to Maya Chen",
  "dispositionTowardsPlayer": "professionally cordial",
  "knownEntities": {
    "npcsKnown": [],
    "locationsKnown": ["loc_harbourPointHotel", "loc_mainStreet", "loc_sheriffStation", "loc_sirensCove", "loc_library"]
  },
  "questInvolvement": ["quest_missingJournalist"],
  "inventory": [
    {
      "name": "Deputy Badge",
      "description": "Standard issue Blackwater Bay deputy badge",
      "quantity": 1
    },
    {
      "name": "Service Weapon",
      "description": "Department-issued sidearm in a holster",
      "quantity": 1
    },
    {
      "name": "Personal Notepad",
      "description": "Small notepad with observations about Maya Chen's case",
      "quantity": 1
    }
  ],
  "conversationLog": [
    {
      "Player": "What can you tell me about the missing journalist?",
      "Deputy Parker": "Official statement is she likely took a walk along the cliffs and had an accident. Happens every few years with tourists. But... [glances around] search protocols have been strange. Sheriff's got us avoiding the north caves and old cannery entirely. Those would be standard search areas. I've said too much already."
    },
    {
      "Player": "Did you interact with Maya Chen before she disappeared?",
      "Deputy Parker": "Just once. She came in requesting public records about the Thomas family incident. Sheriff took over personally, which isn't standard procedure. My fiancée at the library said Ms. Chen was researching town founders and property records dating back to the 1920s. She seemed... troubled the last time she visited the library. Like she'd found something that scared her."
    }
  ]
} 
