{ "type": "LOCATION", "id": "loc_mainStreet",
  "name": "Main Street",
  "locationType": "urban",
  "description": "The central thoroughfare of Blackwater Bay, lined with Victorian-era buildings painted in faded pastels. Decorative banners announcing the upcoming Founder's Day Festival hang between ornate lampposts. Most businesses are locally owned, with no chain stores in sight. Despite the quaint appearance, there's a palpable tension beneath the friendly small-town facade.",
  "discoveredByPlayer": true,

  "connectedLocations": [
    { "type": "LOCATION", "id": "loc_harbourPointHotel",
      "description": "The grand old hotel sits at the north end of Main Street, overlooking the bay from its clifftop perch."
    },
    { "type": "LOCATION", "id": "loc_sheriffStation",
      "description": "The brick building housing the town's law enforcement is prominently situated in the middle of Main Street."
    },
    { "type": "LOCATION", "id": "loc_townHall",
      "description": "The administrative center of Blackwater Bay, an imposing Greek Revival building with columns."
    },
    { "type": "LOCATION", "id": "loc_library",
      "description": "A charming historic building with stained glass windows, housing the town's archives and book collection."
    }
  ],

  "parentLocation": { "type": "LOCATION", "id": "loc_blackwaterBay",
    "description": "The commercial and social heart of Blackwater Bay."
  },

  "subLocations": [
    { "type": "LOCATION", "id": "loc_mainStreet_cafe",
      "description": "The Lighthouse Cafe, a cozy establishment where locals gather to share gossip over coffee and homemade pie."
    },
    { "type": "LOCATION", "id": "loc_mainStreet_gazette",
      "description": "The offices of the Blackwater Bay Gazette, the local newspaper that has operated continuously since 1892."
    }
  ],

  "npcs": [
    "npc_cafeOwner",
    "npc_newspaperEditor"
  ],

  "pointsOfInterest": [
    {
      "name": "Founder's Monument",
      "description": "A weathered stone monument depicting the town's three founding families - the Thomases, Fletchers, and Carters. The same symbol found in Maya's notes - three wavy lines in a circle - is subtly incorporated into the design."
    },
    {
      "name": "Community Bulletin Board",
      "description": "A large cork board outside the post office displaying community announcements, including details about the upcoming Founder's Day Festival and a missing person poster for Maya Chen that looks newer than the surrounding notices."
    },
    {
      "name": "Memorial Plaques",
      "description": "Bronze plaques embedded in the sidewalk commemorating significant town events, with a conspicuous gap in the chronology around 1998, the year the Thomas family disappeared."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [],

  "historyLog": [
    {
      "timestamp": "2023-10-24T09:30:00Z",
      "event": "festivalPreparation",
      "description": "Town workers are setting up additional decorations for the Founder's Day Festival while the mayor supervises, seeming unusually concerned with every detail."
    }
  ],

  "notes": "Main Street serves as the public face of Blackwater Bay, carefully maintained to project an image of small-town charm and prosperity. Businesses are primarily owned by descendants of the founding families, particularly the Fletchers since the Thomases disappeared. Conversations often go quiet when strangers approach, and there's a noticeable defensiveness when the town's history is discussed. The missing journalist is a topic that townspeople actively avoid."
} 

