{ "type": "LOCATION", "id": "loc_townHall",
  "name": "Town Hall",
  "locationType": "building",
  "description": "An imposing Greek Revival building with white columns and broad steps leading to the entrance. The interior features high ceilings, polished wooden floors, and portraits of past mayors and prominent citizens. Municipal records are kept in a carefully controlled archive room, and the town council meets in a formal chamber with tiered seating.",
  "discoveredByPlayer": true,

  "connectedLocations": [
    { "type": "LOCATION", "id": "loc_mainStreet",
      "description": "The central thoroughfare where most municipal buildings are located."
    },
    { "type": "LOCATION", "id": "loc_sheriffStation",
      "description": "The brick building housing the town's law enforcement, located across the street."
    }
  ],

  "parentLocation": { "type": "LOCATION", "id": "loc_blackwaterBay",
    "description": "The Town Hall serves as the administrative center of Blackwater Bay."
  },

  "subLocations": [
    { "type": "LOCATION", "id": "loc_townHall_mayorOffice",
      "description": "The mayor's private office, featuring antique furniture and a panoramic view of the town."
    },
    { "type": "LOCATION", "id": "loc_townHall_archives",
      "description": "A secure room containing historical records, property deeds, and municipal documents dating back to the town's founding."
    }
  ],

  "npcs": [
    "npc_mayor",
    "npc_townClerk"
  ],

  "pointsOfInterest": [
    {
      "name": "Founding Families Display",
      "description": "A glass case containing artifacts and documents related to the town's founding families, with the Thomas family section noticeably smaller than the others."
    },
    {
      "name": "Property Maps",
      "description": "Large framed maps showing land ownership in and around Blackwater Bay. Some recent changes to coastal property boundaries are marked in red ink."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [],

  "historyLog": [
    {
      "timestamp": "2023-10-24T11:30:00Z",
      "event": "councilMeeting",
      "description": "An emergency town council meeting was held behind closed doors. Raised voices could be heard through the thick oak doors."
    }
  ],

  "notes": "The Town Hall staff seem particularly protective of certain historical records, especially those relating to property ownership near Siren's Cove. The mayor, a member of the Fletcher family, has been heavily promoting the upcoming Founder's Day Festival, which commemorates the three founding families. Despite the Thomas family's disappearance, they remain technically represented in festival materials, though minimally so."
}