{ "type": "LOCATION", "id": "loc_sheriffStation",
  "name": "Sheriff's Station",
  "locationType": "building",
  "description": "A modest brick building on Main Street housing the town's law enforcement. The interior is functional and orderly with a reception area, three desks for deputies, Sheriff Carter's private office, and a small holding cell. Maps of the area cover one wall, with pins marking various incidents. A locked evidence room is visible behind a reinforced door.",
  "discoveredByPlayer": true,

  "connectedLocations": [
    { "type": "LOCATION", "id": "loc_mainStreet",
      "description": "The town's central thoroughfare, where most municipal buildings are located."
    },
    { "type": "LOCATION", "id": "loc_townHall",
      "description": "The seat of local government, located just across the street from the Sheriff's Station."
    }
  ],

  "parentLocation": { "type": "LOCATION", "id": "loc_blackwaterBay",
    "description": "The Sheriff's Station serves as the primary law enforcement center for the entire town of Blackwater Bay."
  },

  "subLocations": [
    { "type": "LOCATION", "id": "loc_sheriffStation_office",
      "description": "Sheriff Carter's private office, furnished with a heavy oak desk, filing cabinets, and a wall of commendations. A map of the area from 20 years ago hangs on one wall with multiple notes and markings."
    },
    { "type": "LOCATION", "id": "loc_sheriffStation_evidenceRoom",
      "description": "A secure room containing evidence from active and cold cases, including items collected from Maya Chen's hotel room."
    }
  ],

  "npcs": [
    "npc_sheriffCarter",
    "npc_deputyParker"
  ],

  "pointsOfInterest": [
    {
      "name": "Cold Case Files",
      "description": "A filing cabinet labeled 'Cold Cases' with a prominent drawer marked 'Thomas Family - Restricted Access'."
    },
    {
      "name": "Bulletin Board",
      "description": "A cork board with missing person reports, including a freshly posted flyer for Maya Chen. Older flyers appear faded but remain posted."
    },
    {
      "name": "Evidence Log",
      "description": "A logbook on the front desk recording items checked into evidence, including recent entries for 'Chen, M. - personal effects' signed by Sheriff Carter herself rather than the evidence clerk."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [],

  "historyLog": [
    {
      "timestamp": "2023-10-22T09:15:00Z",
      "event": "officialReport",
      "description": "Maya Chen officially reported missing after failing to check out of the hotel and missing her scheduled interviews."
    },
    {
      "timestamp": "2023-10-22T14:30:00Z",
      "event": "evidenceCollection",
      "description": "Sheriff Carter personally collected and cataloged Maya Chen's belongings from Room 312."
    }
  ],

  "notes": "The station has a tense atmosphere. Deputies seem to follow Sheriff Carter's orders without question, but quiet conversations stop when visitors enter. The Thomas Family case files are kept under unusually tight security, and staff appear uncomfortable when asked about them. Recent radio communications suggest search parties have been organized along the coastal paths, but strangely little public information has been released about the search efforts."
} 

