{ "type": "LOCATION", "id": "loc_sirensCove",
  "name": "Siren's Cove",
  "locationType": "coastal",
  "description": "A secluded beach accessible only by a steep path down the cliffs. Black volcanic sand glitters under the moonlight, and jagged rock formations create eerie shadows. The constant crash of waves against the cliffs drowns out other sounds. Several sea caves are visible along the base of the cliff, partially submerged at high tide. Local legends claim the cove was once used for secret meetings and rituals by the town's founding families.",
  "discoveredByPlayer": false,

  "connectedLocations": [
    { "type": "LOCATION", "id": "loc_cliffPath",
      "description": "A winding, treacherous path that leads up the cliffs to the main road and Harbour Point Hotel."
    },
    { "type": "LOCATION", "id": "loc_abandonedCannery",
      "description": "A decrepit industrial building at the north end of the cove, once owned by the Thomas family."
    }
  ],

  "parentLocation": { "type": "LOCATION", "id": "loc_blackwaterBay",
    "description": "One of the most mysterious and dangerous coastal areas in Blackwater Bay."
  },

  "subLocations": [
    { "type": "LOCATION", "id": "loc_sirensCove_mainBeach",
      "description": "The crescent-shaped stretch of dark sand where unusual items often wash ashore after storms."
    },
    { "type": "LOCATION", "id": "loc_sirensCove_northCaves",
      "description": "A network of sea caves accessible only at low tide, with strange symbols carved into the walls."
    }
  ],

  "npcs": [],

  "pointsOfInterest": [
    {
      "name": "Tidal Caves",
      "description": "Several dark openings in the cliff face that are only accessible at low tide. Local legends claim these caves connect to tunnels running beneath the town."
    },
    {
      "name": "Ritual Circle",
      "description": "Weathered stones arranged in a circle near the north end of the beach. Some stones bear faint carvings of three wavy lines within a circle."
    },
    {
      "name": "Wrecked Rowboat",
      "description": "A damaged small boat half-buried in the sand. The name 'Thomas' is barely visible on its hull."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [
    {
      "itemId": "item_strangePendant",
      "hidden": true
    }
  ],

  "historyLog": [
    {
      "timestamp": "2023-10-21T22:30:00Z",
      "event": "lastSighting",
      "description": "A local fisherman reported seeing a woman matching Maya Chen's description heading toward the tidal caves with a flashlight."
    },
    {
      "timestamp": "2023-10-22T06:15:00Z",
      "event": "searchParty",
      "description": "Sheriff's department conducted a brief search of the main beach but did not enter the caves due to 'dangerous tides.'"
    }
  ],

  "notes": "The cove seems to be deliberately avoided by most locals, especially after dark. The tides here are unpredictable and dangerous, potentially trapping unwary visitors in the caves. There are persistent rumors of strange lights and chanting heard from the caves on certain nights of the year. Both the Thomas family disappearance and Maya Chen's investigation seem connected to this location."
} 

