{ "type": "LOCATION", "id": "loc_abandonedCannery",
  "name": "Abandoned Cannery",
  "locationType": "building",
  "description": "A decrepit industrial building situated at the north end of Siren's Cove. Once the economic heart of Blackwater Bay, the Thomas family's cannery has stood abandoned for the past twenty years. The weathered brick structure is partially collapsed in places, with broken windows and equipment rusting inside. Faded signage reading 'Thomas Seafood Company' still hangs above the main entrance. The building is officially condemned, but shows signs of occasional use.",
  "discoveredByPlayer": false,

  "connectedLocations": [
    { "type": "LOCATION", "id": "loc_sirensCove",
      "description": "The secluded beach with black volcanic sand stretches to the south of the cannery."
    }
  ],

  "parentLocation": { "type": "LOCATION", "id": "loc_blackwaterBay",
    "description": "The Abandoned Cannery sits at the edge of town, accessible primarily via Siren's Cove."
  },

  "subLocations": [
    { "type": "LOCATION", "id": "loc_abandonedCannery_mainFloor",
      "description": "The cavernous processing area where fish were once prepared and canned. Rusty machinery and conveyor belts still line the space."
    },
    { "type": "LOCATION", "id": "loc_abandonedCannery_office",
      "description": "The former administrative offices of the Thomas family business, with desks and filing cabinets in disarray. Some recent disturbance is evident."
    },
    { "type": "LOCATION", "id": "loc_abandonedCannery_basement",
      "description": "A damp, partially flooded lower level that connects to the sea caves via a hidden passage. Strange symbols are carved into the stone walls."
    }
  ],

  "npcs": [],

  "pointsOfInterest": [
    {
      "name": "Family Photograph",
      "description": "A cracked frame containing a photograph of the Thomas family standing proudly in front of the then-new cannery building, dated 1982."
    },
    {
      "name": "Secret Room",
      "description": "A hidden chamber behind a false wall in the basement, containing evidence of recent occupancy including candles, blankets, and various ritual objects."
    },
    {
      "name": "Carved Symbol",
      "description": "A large version of the three wavy lines in a circle has been chiseled into the concrete floor of the basement, with channels that appear designed to direct water or possibly other liquids."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [
    {
      "itemId": "item_ritualBook",
      "hidden": true
    }
  ],

  "historyLog": [
    {
      "timestamp": "2023-10-20T23:30:00Z",
      "event": "lightsSighting",
      "description": "A local fisherman reported seeing unusual lights moving inside the supposedly abandoned cannery late at night."
    }
  ],

  "notes": "Though officially abandoned and condemned, the cannery shows signs of recent use, including fresh footprints in the dust and candle wax that isn't decades old. The building itself seems to be a focal point of the town's darker history, with connections to both the Thomas family disappearance and Maya Chen's investigation. There are rumors among older residents that the Thomas family used the cannery for more than just processing fish, particularly in its basement levels that connect to the sea caves. Despite its historical significance, most townspeople avoid discussing the cannery altogether."
}