{
  "id": "loc_harbourPointHotel",
  "name": "Harbour Point Hotel",
  "type": "building",
  "description": "A Victorian-era hotel perched on the cliffs overlooking Blackwater Bay. Once the crown jewel of the town, the hotel retains its elegance despite signs of age. The lobby features dark wood paneling, brass fixtures, and a magnificent view of the bay through tall windows. Room 312, your current accommodation, was also rented by Maya Chen before her disappearance.",
  "discoveredByPlayer": true,

  "connectedLocations": [
    {
      "id": "loc_mainStreet",
      "description": "The town's primary thoroughfare lined with shops, restaurants, and municipal buildings."
    },
    {
      "id": "loc_cliffPath",
      "description": "A winding trail along the cliffs that connects the hotel to Siren's Cove Beach below."
    }
  ],

  "parentLocation": {
    "id": "loc_blackwaterBay",
    "description": "Harbour Point Hotel is one of the most prominent landmarks in the coastal town of Blackwater Bay."
  },

  "subLocations": [
    {
      "id": "loc_harbourPointHotel_lobby",
      "description": "The elegant main lobby with a mahogany reception desk, antique furniture, and a crackling fireplace."
    },
    {
      "id": "loc_harbourPointHotel_room312",
      "description": "Your room, which features a comfortable queen bed, a writing desk by the window, and a connecting bathroom. Maya Chen stayed here before disappearing."
    }
  ],

  "npcs": [
    "npc_hotelManager"
  ],

  "pointsOfInterest": [
    {
      "name": "Reception Desk",
      "description": "A mahogany desk where the somewhat nervous hotel manager, Roland Wells, typically stands. The guest register and room keys are kept here."
    },
    {
      "name": "Old Photographs",
      "description": "The walls are lined with historical photographs of Blackwater Bay, including one showing the Thomas family with the hotel in the background."
    },
    {
      "name": "Loose Floorboard",
      "description": "In room 312, a floorboard near the window seems loose and slightly raised compared to the others."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [],

  "historyLog": [
    {
      "timestamp": "2023-10-23T16:30:00Z",
      "event": "playerArrived",
      "description": "The player checked into the hotel and was assigned room 312, the same room where Maya Chen had stayed."
    },
    {
      "timestamp": "2023-10-24T07:45:00Z",
      "event": "hotelRumors",
      "npcId": "npc_hotelManager",
      "description": "The hotel manager mentioned that Maya Chen had been asking 'uncomfortable questions' around town."
    }
  ],

  "notes": "The hotel seems to be a hub of gossip and information about town happenings. Staff and long-term residents appear somewhat guarded when discussing recent events or the town's history. Some rooms on the third floor, including 312, have been renovated more recently than others."
} 