{ "type": "LOCATION", "id": "loc_harbourPointHotel_room312",
  "name": "Room 312",
  "locationType": "room",
  "description": "Your accommodation at the Harbour Point Hotel, the same room where Maya Chen stayed before her disappearance. The comfortable queen bed dominates the space, with a writing desk positioned by the window that offers a view of the bay and Siren's Cove in the distance. The decor maintains the hotel's vintage charm with floral wallpaper and antique furnishings. A connecting bathroom features a clawfoot tub and pedestal sink.",
  "discoveredByPlayer": true,

  "connectedLocations": [],

  "parentLocation": { "type": "LOCATION", "id": "loc_harbourPointHotel",
    "description": "Located on the third floor of the Harbour Point Hotel, at the end of the hallway."
  },

  "subLocations": [],

  "npcs": [],

  "pointsOfInterest": [
    {
      "name": "Loose Floorboard",
      "description": "A floorboard near the window that seems raised compared to the others. It can be lifted to reveal a small hiding space beneath."
    },
    {
      "name": "Desk Drawer",
      "description": "The bottom drawer of the writing desk has a false back, potentially used to conceal items from casual observers."
    },
    {
      "name": "Bathroom Mirror",
      "description": "The vintage mirror above the bathroom sink has faint writing visible when fogged up, appearing to be coordinates or directions."
    }
  ],

  "questIds": ["quest_missingJournalist"],

  "items": [
    {
      "itemId": "item_hiddenNote",
      "hidden": true
    }
  ],

  "historyLog": [
    {
      "timestamp": "2023-10-22T10:45:00Z",
      "event": "roomInspection",
      "description": "Sheriff Carter personally searched the room and collected Maya Chen's belongings after she was reported missing."
    }
  ],

  "notes": "Though the room has been cleaned since Maya Chen's disappearance, subtle clues remain that suggest her investigation had uncovered something significant. The hotel staff claim that all her belongings were handed over to the sheriff, but the hiding places in the room haven't been thoroughly checked. There's a persistent feeling of being watched when in the room, especially at night, and other guests have reported hearing footsteps in the hallway outside even when no one is visible."
}